# 4.5 Practice Exercise

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Importing data set
path = r'/Users/jordanhenghold/Documents/06-09-2023 Instacart Basket Analysis'

In [3]:
# Importing product.csv data set
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [30]:
# Importing data set order_wrangled
df = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

### Data Concistency Check Practice

In [6]:
# Create a dataframe
df_test = pd.DataFrame()

In [7]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [35]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [38]:
# Check dataframe for mixed type column
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

NOTE: ^^^^^ was "mix" before I reran this function. I have abviously changed this theresfter so it no longer shows.

In [37]:
#converting datatype from numeric to stri
df_test['mix'] = df_test['mix'].astype('str')

### Find Missing Values Practice

In [11]:
# Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
# Check number of rows in product dataframe
df_prods.shape

(49693, 5)

In [15]:
# Create new dataframe for non missing value
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
df_prods_clean.shape

(49677, 5)

In [17]:
# Look for duplicates in products dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
# Create new dataframe without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [20]:
df_prods_clean_no_dups.shape

(49672, 5)

In [21]:
# Export new dataframe as products_checked
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

##### Type Markdown and LaTeX:  𝛼2

# Task 4.5

### Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [22]:
# Check frequency of df_ords dataframe
df.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_following_previous_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

While disecting the frequency table I notice that the max and min section, the days_following_previous_order possesses odd variables. As the min = 0 and the max = 3 (days), when examining the percentile range, there are also noticable irregularities. The 50th percentile is 7, which is greater than the max value. Number of orders shows similarities in this regard since it possesses a min value of 1 and max value of 1. That being said, percentile ranges do not show consistency in comparison to this regard. An example of the validity to this statement is indicated by 25% being recorded as 5, which is greater than the max value of 1.

Type Markdown and LaTeX:  𝛼2

### Check for mixed-type data in your df_ords dataframe.

In [41]:
df.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_following_previous_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [42]:
# checking for mixed data types 
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

No mixed data is within the "df_ords" (my data set has orders as simply "df") data set, as presented by the function I just ran. However, the eval_set has reappeared so I imagine I should remove it again.

### If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [43]:
# Dropping eval_set column from orders.csv
df.drop(columns = ['eval_set'])

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_following_previous_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

Though no mixed data was returned, i readjusted the eval_set column to be omitted again

Type Markdown and LaTeX:  𝛼2

### Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [44]:
# Check for missing values in df_ords (df) data frame
df.isnull().sum()

Unnamed: 0                            0
order_id                              0
user_id                               0
eval_set                              0
order_number                          0
orders_day_of_week                    0
order_hour_of_day                     0
days_following_previous_order    206209
dtype: int64

Many values are missing for days_following_previous_order (206209). When examining the columns individually, the 'NaN' component is evidently connected to 'order_number = 1'. User_id's number total is 206209. This is the exact number of missing values in question. Being that user_id = 1 is missing components inside the days_since_prior_order column. This connects to data from number_of_orders, bringing clarity to this scenario, being that customers which purchase on a first time order do not possess prior orders. This means the column should be left as blank.

Type Markdown and LaTeX:  𝛼2

### Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice.

In [46]:
# Create a new data frame df_nan for null values of column day_since_prior_order
df_nan = df[df['days_following_previous_order'].isnull() == True]

In [50]:
# View new data frame df_nan
df_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_following_previous_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

In [60]:
# Search number_of_orders column for missing values for each value in column.  
df['order_number'].value_counts(dropna = False) # Shows # number 206209 is in fact missing values

order_number
1      206209
2      206209
3      206209
4      206209
5      182223
        ...
96       1592
97       1525
98       1471
99       1421
100      1374
Name: count, Length: 100, dtype: int64

The value which is missinng is indicative of the data represented by first-time orders. This tells us so much about the data in reference to the customer relationship with each order. The column in discussion has become a highly important data piece, which is why the data will not be removed or discarded.

Type Markdown and LaTeX:  𝛼2

### Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [62]:
# Check for duplicate values in df data frame
df_dups = df[df.duplicated()]

In [63]:
# View duplicates values for df
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_following_previous_order]
Index: []

No duplicates were found in the data frame df_ords (df in my data set) data frame

Type Markdown and LaTeX:  𝛼2

### Address the duplicates using an appropriate method. In a markdown cell, explain why you used your method of choice.

Thankfully, once again, it is to be noted that there are no duplicates found in the data frame df_ords (df in my data set) data frame

### Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [65]:
# Exporting df as orders_checked
df.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [66]:
# Exporting df_prods as products_checked
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))